{
  "class_name": "Model",
  "config": {
    "name": "model_11",
    "layers": [
      {
        "name": "data",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 128, 128, 3],
          "dtype": "float32",
          "sparse": false,
          "name": "data"
        },
        "inbound_nodes": []
      },
      {
        "name": "bn_data",
        "class_name": "BatchNormalization",
        "config": {
          "name": "bn_data",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": false,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["data", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_171",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_171",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [3, 3],
            [3, 3]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["bn_data", 0, 0, {}]]]
      },
      {
        "name": "conv0",
        "class_name": "Conv2D",
        "config": {
          "name": "conv0",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [7, 7],
          "strides": [2, 2],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_171", 0, 0, {}]]]
      },
      {
        "name": "bn0",
        "class_name": "BatchNormalization",
        "config": {
          "name": "bn0",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["conv0", 0, 0, {}]]]
      },
      {
        "name": "relu0",
        "class_name": "Activation",
        "config": {
          "name": "relu0",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["bn0", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_172",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_172",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["relu0", 0, 0, {}]]]
      },
      {
        "name": "pooling0",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "pooling0",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [3, 3],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["zero_padding2d_172", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit1_bn1",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage1_unit1_bn1",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["pooling0", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit1_relu1",
        "class_name": "Activation",
        "config": {
          "name": "stage1_unit1_relu1",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_173",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_173",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit1_conv1",
        "class_name": "Conv2D",
        "config": {
          "name": "stage1_unit1_conv1",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_173", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit1_bn2",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage1_unit1_bn2",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit1_relu2",
        "class_name": "Activation",
        "config": {
          "name": "stage1_unit1_relu2",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_174",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_174",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit1_conv2",
        "class_name": "Conv2D",
        "config": {
          "name": "stage1_unit1_conv2",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_174", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit1_sc",
        "class_name": "Conv2D",
        "config": {
          "name": "stage1_unit1_sc",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]
      },
      {
        "name": "add_81",
        "class_name": "Add",
        "config": { "name": "add_81", "trainable": true, "dtype": "float32" },
        "inbound_nodes": [
          [
            ["stage1_unit1_conv2", 0, 0, {}],
            ["stage1_unit1_sc", 0, 0, {}]
          ]
        ]
      },
      {
        "name": "stage1_unit2_bn1",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage1_unit2_bn1",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["add_81", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit2_relu1",
        "class_name": "Activation",
        "config": {
          "name": "stage1_unit2_relu1",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_175",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_175",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit2_conv1",
        "class_name": "Conv2D",
        "config": {
          "name": "stage1_unit2_conv1",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_175", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit2_bn2",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage1_unit2_bn2",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit2_relu2",
        "class_name": "Activation",
        "config": {
          "name": "stage1_unit2_relu2",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_176",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_176",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit2_conv2",
        "class_name": "Conv2D",
        "config": {
          "name": "stage1_unit2_conv2",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_176", 0, 0, {}]]]
      },
      {
        "name": "add_82",
        "class_name": "Add",
        "config": { "name": "add_82", "trainable": true, "dtype": "float32" },
        "inbound_nodes": [
          [
            ["stage1_unit2_conv2", 0, 0, {}],
            ["add_81", 0, 0, {}]
          ]
        ]
      },
      {
        "name": "stage1_unit3_bn1",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage1_unit3_bn1",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["add_82", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit3_relu1",
        "class_name": "Activation",
        "config": {
          "name": "stage1_unit3_relu1",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage1_unit3_bn1", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_177",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_177",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage1_unit3_relu1", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit3_conv1",
        "class_name": "Conv2D",
        "config": {
          "name": "stage1_unit3_conv1",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_177", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit3_bn2",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage1_unit3_bn2",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["stage1_unit3_conv1", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit3_relu2",
        "class_name": "Activation",
        "config": {
          "name": "stage1_unit3_relu2",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage1_unit3_bn2", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_178",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_178",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage1_unit3_relu2", 0, 0, {}]]]
      },
      {
        "name": "stage1_unit3_conv2",
        "class_name": "Conv2D",
        "config": {
          "name": "stage1_unit3_conv2",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_178", 0, 0, {}]]]
      },
      {
        "name": "add_83",
        "class_name": "Add",
        "config": { "name": "add_83", "trainable": true, "dtype": "float32" },
        "inbound_nodes": [
          [
            ["stage1_unit3_conv2", 0, 0, {}],
            ["add_82", 0, 0, {}]
          ]
        ]
      },
      {
        "name": "stage2_unit1_bn1",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage2_unit1_bn1",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["add_83", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit1_relu1",
        "class_name": "Activation",
        "config": {
          "name": "stage2_unit1_relu1",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_179",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_179",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit1_conv1",
        "class_name": "Conv2D",
        "config": {
          "name": "stage2_unit1_conv1",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [2, 2],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_179", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit1_bn2",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage2_unit1_bn2",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit1_relu2",
        "class_name": "Activation",
        "config": {
          "name": "stage2_unit1_relu2",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_180",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_180",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit1_conv2",
        "class_name": "Conv2D",
        "config": {
          "name": "stage2_unit1_conv2",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_180", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit1_sc",
        "class_name": "Conv2D",
        "config": {
          "name": "stage2_unit1_sc",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [1, 1],
          "strides": [2, 2],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]
      },
      {
        "name": "add_84",
        "class_name": "Add",
        "config": { "name": "add_84", "trainable": true, "dtype": "float32" },
        "inbound_nodes": [
          [
            ["stage2_unit1_conv2", 0, 0, {}],
            ["stage2_unit1_sc", 0, 0, {}]
          ]
        ]
      },
      {
        "name": "stage2_unit2_bn1",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage2_unit2_bn1",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["add_84", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit2_relu1",
        "class_name": "Activation",
        "config": {
          "name": "stage2_unit2_relu1",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_181",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_181",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit2_conv1",
        "class_name": "Conv2D",
        "config": {
          "name": "stage2_unit2_conv1",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_181", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit2_bn2",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage2_unit2_bn2",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit2_relu2",
        "class_name": "Activation",
        "config": {
          "name": "stage2_unit2_relu2",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_182",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_182",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit2_conv2",
        "class_name": "Conv2D",
        "config": {
          "name": "stage2_unit2_conv2",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_182", 0, 0, {}]]]
      },
      {
        "name": "add_85",
        "class_name": "Add",
        "config": { "name": "add_85", "trainable": true, "dtype": "float32" },
        "inbound_nodes": [
          [
            ["stage2_unit2_conv2", 0, 0, {}],
            ["add_84", 0, 0, {}]
          ]
        ]
      },
      {
        "name": "stage2_unit3_bn1",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage2_unit3_bn1",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["add_85", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit3_relu1",
        "class_name": "Activation",
        "config": {
          "name": "stage2_unit3_relu1",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage2_unit3_bn1", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_183",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_183",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage2_unit3_relu1", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit3_conv1",
        "class_name": "Conv2D",
        "config": {
          "name": "stage2_unit3_conv1",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_183", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit3_bn2",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage2_unit3_bn2",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["stage2_unit3_conv1", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit3_relu2",
        "class_name": "Activation",
        "config": {
          "name": "stage2_unit3_relu2",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage2_unit3_bn2", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_184",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_184",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage2_unit3_relu2", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit3_conv2",
        "class_name": "Conv2D",
        "config": {
          "name": "stage2_unit3_conv2",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_184", 0, 0, {}]]]
      },
      {
        "name": "add_86",
        "class_name": "Add",
        "config": { "name": "add_86", "trainable": true, "dtype": "float32" },
        "inbound_nodes": [
          [
            ["stage2_unit3_conv2", 0, 0, {}],
            ["add_85", 0, 0, {}]
          ]
        ]
      },
      {
        "name": "stage2_unit4_bn1",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage2_unit4_bn1",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["add_86", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit4_relu1",
        "class_name": "Activation",
        "config": {
          "name": "stage2_unit4_relu1",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage2_unit4_bn1", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_185",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_185",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage2_unit4_relu1", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit4_conv1",
        "class_name": "Conv2D",
        "config": {
          "name": "stage2_unit4_conv1",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_185", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit4_bn2",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage2_unit4_bn2",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["stage2_unit4_conv1", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit4_relu2",
        "class_name": "Activation",
        "config": {
          "name": "stage2_unit4_relu2",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage2_unit4_bn2", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_186",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_186",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage2_unit4_relu2", 0, 0, {}]]]
      },
      {
        "name": "stage2_unit4_conv2",
        "class_name": "Conv2D",
        "config": {
          "name": "stage2_unit4_conv2",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_186", 0, 0, {}]]]
      },
      {
        "name": "add_87",
        "class_name": "Add",
        "config": { "name": "add_87", "trainable": true, "dtype": "float32" },
        "inbound_nodes": [
          [
            ["stage2_unit4_conv2", 0, 0, {}],
            ["add_86", 0, 0, {}]
          ]
        ]
      },
      {
        "name": "stage3_unit1_bn1",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage3_unit1_bn1",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["add_87", 0, 0, {}]]]
      },
      {
        "name": "stage3_unit1_relu1",
        "class_name": "Activation",
        "config": {
          "name": "stage3_unit1_relu1",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_187",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_187",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]
      },
      {
        "name": "stage3_unit1_conv1",
        "class_name": "Conv2D",
        "config": {
          "name": "stage3_unit1_conv1",
          "trainable": true,
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [2, 2],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 2.0,
              "mode": "fan_in",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [[["zero_padding2d_187", 0, 0, {}]]]
      },
      {
        "name": "stage3_unit1_bn2",
        "class_name": "BatchNormalization",
        "config": {
          "name": "stage3_unit1_bn2",
          "trainable": true,
          "dtype": "float32",
          "axis": 3,
          "momentum": 0.99,
          "epsilon": 2e-5,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]]
      },
      {
        "name": "stage3_unit1_relu2",
        "class_name": "Activation",
        "config": {
          "name": "stage3_unit1_relu2",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]]
      },
      {
        "name": "zero_padding2d_188",
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_188",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 1],
            [1, 1]
          ],
          "data_format": "channels_last"
        },
        "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]]
      },
      {
        "name": "stage3_unit1_conv2",
        "class_name": "Conv2D",
        "config": {
          "name": "stage3_unit1_conv2",
          "trainable": true,
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
